---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType
source: html/d70b0f45-986e-7777-0066-64de63b92741.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleMarkerTextLabelType

Text label visualization types for Markers and Text settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleMarkerTextLabelType
```